src/BusinessProcesses/ПроверкаДокументации/ПроверкаДокументации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>ПроверкаДокументации</name>
  <task>Task.ЗадачаИсполнителя</task>
  <attributes>
    <name>ЗадачаМетеор</name>
    <type>
      <types>CatalogRef.ЗадачиМетеор</types>
    </type>
  </attributes>
</mdclass:BusinessProcess>

src/InformationRegisters/РезультатыПроверкиДокументации/РезультатыПроверкиДокументации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РезультатыПроверкиДокументации</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Результат</name>
    <type>
      <types>EnumRef.ВариантыРезультатовПроверкиДокументации</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>АвторОценки</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗадачиТехдолг</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПояснениеДляПроверяющего</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ЗадачаМетеор</name>
    <type>
      <types>CatalogRef.ЗадачиМетеор</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидПроверки</name>
    <type>
      <types>CatalogRef.ВидыПроверокДокументации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СледующиеЭтапыЗадачиПоТочкеМаршрута/СледующиеЭтапыЗадачиПоТочкеМаршрута.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СледующиеЭтапыЗадачиПоТочкеМаршрута</name>
  <dimensions>
    <name>ТочкаМаршрута</name>
    <type>
      <types>BusinessProcessRoutePointRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Согласовано</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Этап</name>
    <type>
      <types>CatalogRef.ЭтапыЗадачиМетеор</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ВариантыРезультатовПроверкиДокументации/ВариантыРезультатовПроверкиДокументации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыРезультатовПроверкиДокументации</name>
  <enumValues>
    <name>Согласовано</name>
  </enumValues>
  <enumValues>
    <name>НеСогласовано</name>
  </enumValues>
  <enumValues>
    <name>ПроверкаНеТребуется</name>
  </enumValues>
</mdclass:Enum>

src/BusinessProcesses/ПроверкаДокументации/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытийКартыМаршрута

Процедура ПеревестиНаСледующийЭтапПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
	Если Не ИнтеграцияСМетеор.ПроверитьТекущийЭтапЗадачиВМетеоре(ЗадачаМетеор, Справочники.ЭтапыЗадачиМетеор.ПроверкаДокументации) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИСТИНА КАК ПроверкиСогласованы
		|ИЗ
		|	РегистрСведений.РезультатыПроверкиДокументации.СрезПоследних КАК РезультатыПроверкиДокументацииСрезПоследних
		|ГДЕ
		|	РезультатыПроверкиДокументацииСрезПоследних.ЗадачаМетеор = &ЗадачаМетеор
		|
		|ИМЕЮЩИЕ
		|	СУММА(ВЫБОР
		|			КОГДА РезультатыПроверкиДокументацииСрезПоследних.Результат = ЗНАЧЕНИЕ(Перечисление.ВариантыРезультатовПроверкиДокументации.НеСогласовано)
		|				ТОГДА 1
		|			ИНАЧЕ 0
		|		КОНЕЦ) = 0 И
		|	КОЛИЧЕСТВО(РезультатыПроверкиДокументацииСрезПоследних.ЗадачаМетеор) > 0";
	
	Запрос.УстановитьПараметр("ЗадачаМетеор", ЗадачаМетеор);
	РезультатЗапроса = Запрос.Выполнить();
	Согласовано = Не РезультатЗапроса.Пустой();
	
	Этапы = РегистрыСведений.СледующиеЭтапыЗадачиПоТочкеМаршрута.ПолучитьЭтапыПоТочкеМаршрута(
		Бизнеспроцессы.ПроверкаДокументации.ТочкиМаршрута.Действие1,
		Согласовано);
	ИнтеграцияСМетеор.ПеревестиЗадачуНаЭтапВМетеоре(ЗадачаМетеор, Этапы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийМодуля

#КонецОбласти

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
